Repository: mohammed-2-5/medassist
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Reports & Export
ar: التقارير والتصدير

# exportYourDataDescription
source: Export your data as CSV or PDF
ar: صدّر بياناتك كـ CSV أو PDF

source: Medications CSV
ar: أدوية CSV

source: Adherence PDF
ar: الالتزام PDF

# discardChangesConfirmation
source: Are you sure you want to discard your changes?
ar: هل أنت متأكد من تجاهل التغييرات؟

source: Error
ar: خطأ

source: AI is thinking...
ar: الذكاء الاصطناعي يفكر...

# addMedicationsToTrackStock
source: Add medications to track their stock levels
ar: أضف أدوية لتتبع مستويات مخزونها

source: Notifications disabled
ar: الإشعارات معطلة

# turnOnReminders
source: Turn on reminders to never miss a dose
ar: قم بتفعيل التذكيرات لعدم تفويت أي جرعة

source: Enable
ar: تفعيل

source: Morning
ar: الصباح

source: Afternoon
ar: بعد الظهر

source: Evening
ar: المساء

source: Night
ar: الليل

source: Notification permission requested
ar: تم طلب إذن الإشعارات

source: How Med Assist Works
ar: كيف يعمل مساعد الدواء

source: Smart Reminders
ar: تذكيرات ذكية

# smartRemindersDescription
source: Get timely alerts even when offline
ar: احصل على تنبيهات في الوقت المناسب حتى عند عدم الاتصال

# privateData
source: 100% Private
ar: خصوصية 100%

# privateDataDescription
source: All data stays on your device
ar: جميع البيانات تبقى على جهازك

source: Flexible Snoozing
ar: غفوة مرنة

# flexibleSnoozingDescription
source: Snooze reminders when you're busy
ar: قم بتأجيل التذكيرات عندما تكون مشغولاً

source: Got it
ar: فهمت

source: Notification Sound
ar: صوت الإشعار

source: Select Notification Sound
ar: اختر صوت الإشعار

# soundDefault
source: Default
ar: الافتراضي

# soundDefaultDescription
source: System default notification sound
ar: صوت الإشعار الافتراضي للنظام

# soundNotification
source: Notification
ar: إشعار

# soundNotificationDescription
source: Standard notification tone
ar: نغمة إشعار قياسية

# soundReminder
source: Reminder
ar: تذكير

# soundReminderDescription
source: Reminder notification
ar: إشعار تذكير

# soundAlert
source: Alert
ar: تنبيه

# soundAlertDescription
source: Alert notification
ar: إشعار تنبيه

source: Preview Sound
ar: معاينة الصوت

source: Sound Preview
ar: معاينة الصوت

source: Custom Sound
ar: صوت مخصص

source: Advanced Settings
ar: إعدادات متقدمة

source: Reminder Settings
ar: إعدادات التذكير

# allSoundsUseSystemDefault
source: All sounds use your device's notification tone
ar: جميع الأصوات تستخدم نغمة الإشعارات في جهازك

source: Smart Snooze
ar: غفوة ذكية

# snoozeRemaining
source: {count, plural, =0{No snoozes left} =1{1 snooze left} other{{count} snoozes left}}
ar: {count, plural, =0{لا يوجد غفوات متبقية} =1{غفوة واحدة متبقية} other{{count} غفوات متبقية}}

# snoozeLimitReached
source: Snooze limit reached today
ar: تم الوصول لحد الغفوة اليوم

# snoozeLimitMessage
source: You've reached the maximum number of snoozes for today. Please take your medication now or skip this dose.
ar: لقد وصلت إلى الحد الأقصى لعدد الغفوات لهذا اليوم. يرجى تناول الدواء الآن أو تخطي هذه الجرعة.

source: Max Snoozes Per Day
ar: أقصى عدد غفوات في اليوم

# smartSnoozeDescription
source: Intelligent snooze suggestions based on your schedule
ar: اقتراحات غفوة ذكية بناءً على جدولك

source: Snooze History
ar: سجل الغفوة

source: Times Snoozed
ar: مرات الغفوة

source: Average Per Day
ar: المتوسط اليومي

# snoozeStats
source: Snooze Statistics
ar: إحصائيات الغفوة

source: Scan Barcode
ar: مسح الباركود

# scanBarcodeInstructions
source: Position the barcode within the frame It will scan automatically
ar: ضع الباركود داخل الإطار سيتم المسح تلقائياً

# medicationNotFoundMessage
source: Could not find medication information for this barcode. Would you like to enter the medication details manually?
ar: لم نتمكن من العثور على معلومات الدواء لهذا الباركود. هل تريد إدخال تفاصيل الدواء يدوياً؟

source: Enter Manually
ar: إدخال يدوي

# errorScanningBarcode
source: An error occurred while scanning the barcode
ar: حدث خطأ أثناء مسح الباركود

source: Try Again
ar: حاول مرة أخرى

source: Backup & Restore
ar: النسخ الاحتياطي والاستعادة

# backupRestoreSubtitle
source: Save or restore your data
ar: احفظ أو استعد بياناتك

# backupInfoMessage
source: Backup stores all your medications, history, and settings. You can restore it anytime.
ar: يحفظ النسخ الاحتياطي جميع أدويتك وسجلك وإعداداتك. يمكنك استعادته في أي وقت.

source: Create Backup
ar: إنشاء نسخة احتياطية

# createBackupDescription
source: Export all your data to a file that you can save or share
ar: تصدير جميع بياناتك إلى ملف يمكنك حفظه أو مشاركته

source: Save to Device
ar: حفظ على الجهاز

source: Share
ar: مشاركة

source: Restore from Backup
ar: استعادة من نسخة احتياطية

# restoreDescription
source: Import data from a backup file. This will replace all current data.
ar: استيراد البيانات من ملف نسخة احتياطية. سيحل هذا محل جميع البيانات الحالية.

# restoreWarning
source: Warning: Current data will be erased
ar: تحذير: سيتم مسح البيانات الحالية

source: Select Backup File
ar: حدد ملف النسخة الاحتياطية
