Repository: mohammed-2-5/medassist
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: MedAssist
ar: مساعد الدواء

source: Home
ar: الرئيسية

source: Medications
ar: الأدوية

source: Reminders
ar: التذكيرات

source: Reports
ar: التقارير

source: Settings
ar: الإعدادات

source: Add Medication
ar: إضافة دواء

source: Edit Medication
ar: تعديل الدواء

source: Delete Medication
ar: حذف الدواء

source: Medication Details
ar: تفاصيل الدواء

source: Medicine Name
ar: اسم الدواء

source: Medicine Type
ar: نوع الدواء

source: Strength
ar: التركيز

source: Dosage
ar: الجرعة

source: Frequency
ar: التكرار

source: Duration
ar: المدة

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Notes
ar: ملاحظات

source: Tablet
ar: حبة

source: Capsule
ar: كبسولة

source: Syrup
ar: شراب

source: Injection
ar: حقنة

source: Drops
ar: قطرة

source: Inhaler
ar: بخاخ

source: Cream
ar: كريم

source: Other
ar: أخرى

source: Times Per Day
ar: مرات في اليوم

source: Dose Per Time
ar: الجرعة لكل مرة

source: Duration (Days)
ar: المدة (أيام)

source: Stock Quantity
ar: كمية المخزون

# lowStockAlert
source: Low stock! Time to refill soon.
ar: تنبيه انخفاض المخزون

source: Enable Low Stock Alert
ar: تفعيل تنبيه انخفاض المخزون

source: Remind Before Run Out
ar: التذكير قبل النفاد

source: Days Before Run Out
ar: الأيام قبل النفاد

source: Reminder Time
ar: وقت التذكير

source: Add Reminder Time
ar: إضافة وقت تذكير

source: Edit Reminder Time
ar: تعديل وقت التذكير

source: Delete Reminder Time
ar: حذف وقت التذكير

source: Notifications
ar: الإشعارات

source: Notifications Enabled
ar: الإشعارات مفعلة

source: Enable Notifications
ar: تفعيل الإشعارات

source: Sound
ar: الصوت

source: Vibration
ar: الاهتزاز

source: Snooze Duration
ar: مدة الغفوة

source: Minutes
ar: دقائق

source: Appearance
ar: المظهر

source: Theme Mode
ar: وضع السمة

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System Default
ar: افتراضي النظام

source: Language
ar: اللغة

source: App Language
ar: لغة التطبيق

source: English
ar: English (إنجليزي)

# arabic
source: العربية (Arabic)
ar: العربية

source: Alerts
ar: التنبيهات

source: Low Stock Alerts
ar: تنبيهات انخفاض المخزون

source: Expiry Alerts
ar: تنبيهات انتهاء الصلاحية

# notifyWhenMedicationRunningLow
source: Notify when medication is running low
ar: التنبيه عند انخفاض كمية الدواء

# notifyWhenMedicationExpiringSoon
source: Notify when medication is expiring soon
ar: التنبيه عند اقتراب انتهاء صلاحية الدواء

source: About
ar: حول

source: App Name
ar: اسم التطبيق

source: Version
ar: الإصدار

source: Build Number
ar: رقم البناء

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Add
ar: إضافة

source: Done
ar: تم

source: Close
ar: إغلاق

source: OK
ar: موافق

source: Yes
ar: نعم

source: No
ar: لا

source: Search
ar: بحث

source: Filter
ar: تصفية

source: Sort by
ar: ترتيب حسب

source: Today
ar: اليوم

source: Tomorrow
ar: غداً

source: Yesterday
ar: أمس

source: This Week
ar: هذا الأسبوع

source: This Month
ar: هذا الشهر

source: Confirm Delete
ar: تأكيد الحذف

# confirmDeleteMessage
source: Are you sure you want to delete this item? This action cannot be undone.
ar: هل أنت متأكد من حذف هذا العنصر؟ لا يمكن التراجع عن هذا الإجراء.

# itemDeleted
source: Item deleted successfully
ar: تم حذف العنصر بنجاح

# itemSaved
source: Item saved successfully
ar: تم حفظ العنصر بنجاح

# noMedications
source: No medications found
ar: لا توجد أدوية

# noReminders
source: No reminders set
ar: لا توجد تذكيرات

# addYourFirstMedication
source: Add your first medication to get started
ar: أضف أول دواء للبدء

source: Take Now
ar: خذ الآن

source: Snooze
ar: غفوة

source: Skip
ar: تخطي

source: Taken
ar: تم التناول

source: Missed
ar: فائت

# timeToTake
source: Time to take {medicationName}
ar: حان وقت تناول {medicationName}

source: Take {dose} now
ar: تناول {dose} الآن

source: Low Stock
ar: مخزون منخفض

# daysOfStockRemaining
source: Only {days} day(s) of stock remaining. Time to refill!
ar: متبقي {days} يوم فقط من المخزون. حان وقت إعادة التعبئة!

source: Troubleshoot Notifications
ar: استكشاف مشاكل الإشعارات

source: Notification Diagnostics
ar: تشخيص الإشعارات

source: Test Notification
ar: اختبار الإشعار

# sendTestNotification
source: Send Test Notification (Now)
ar: إرسال إشعار تجريبي (الآن)

# scheduleTestNotification
source: Schedule Test (1 Minute)
ar: جدولة اختبار (دقيقة واحدة)

source: Request Permissions
ar: طلب الأذونات

source: Exact Alarm Settings
ar: إعدادات المنبه الدقيق

source: Disable Battery Optimization
ar: تعطيل تحسين البطارية

# enableExactAlarms
source: Enable Exact Alarms (REQUIRED)
ar: تفعيل المنبهات الدقيقة (مطلوب)

source: Notification Sound Settings
ar: إعدادات صوت الإشعارات

source: Set Timezone Manually
ar: تعيين المنطقة الزمنية يدوياً

source: App Notification Settings
ar: إعدادات إشعارات التطبيق

source: Status
ar: الحالة

source: Exact Alarms Permission
ar: إذن المنبهات الدقيقة

source: Pending Notifications
ar: الإشعارات المعلقة

source: Timezone
ar: المنطقة الزمنية

source: Device Time
ar: وقت الجهاز

source: Quick Actions
ar: إجراءات سريعة

source: Troubleshooting Tips
ar: نصائح استكشاف الأخطاء

source: Reset to Defaults
ar: إعادة تعيين للافتراضي

source: Reset Settings
ar: إعادة تعيين الإعدادات

# resetSettingsConfirmation
source: Are you sure you want to reset all settings to their default values? This action cannot be undone.
ar: هل أنت متأكد من إعادة تعيين جميع الإعدادات إلى قيمها الافتراضية؟ لا يمكن التراجع عن هذا الإجراء.

# settingsResetSuccessfully
source: Settings reset to defaults
ar: تم إعادة تعيين الإعدادات للافتراضي

source: Data
ar: البيانات

source: Export
ar: تصدير

source: Import
ar: استيراد

source: Backup
ar: نسخ احتياطي

source: Restore
ar: استعادة

# welcomeTitle
source: Welcome to MedAssist
ar: مرحباً بك في مساعد الدواء

# welcomeDescription
source: Your personal medication companion that helps you stay on track with your health journey
ar: رفيقك الشخصي للأدوية الذي يساعدك على البقاء على المسار الصحيح في رحلتك الصحية

# neverMissTitle
source: Never Miss a Dose
ar: لا تفوت أي جرعة

# neverMissDescription
source: Smart reminders ensure you take your medications on time, every time
ar: التذكيرات الذكية تضمن تناول أدويتك في الوقت المحدد، في كل مرة

# trackProgressTitle
source: Track Your Progress
ar: تتبع تقدمك

# trackProgressDescription
source: Monitor your adherence, manage stock levels, and view detailed health insights
ar: راقب التزامك، أدر مستويات المخزون، واعرض رؤى صحية مفصلة

# stayHealthyTitle
source: Stay Healthy & Organized
ar: ابق بصحة جيدة ومنظماً

# stayHealthyDescription
source: Keep all your medications organized in one beautiful, easy-to-use app
ar: احتفظ بجميع أدويتك منظمة في تطبيق واحد جميل وسهل الاستخدام

source: Get Started
ar: ابدأ الآن

source: Step 1 of 3
ar: الخطوة 1 من 3

source: Step 2 of 3
ar: الخطوة 2 من 3

source: Step 3 of 3
ar: الخطوة 3 من 3

source: Basic Information
ar: المعلومات الأساسية

# scheduleAndDuration
source: Schedule & Duration
ar: الجدول والمدة

# stockAndReminder
source: Stock & Reminder
ar: المخزون والتذكير

source: Select medicine type
ar: اختر نوع الدواء

# enterBasicDetails
source: Enter the basic details about your medication
ar: أدخل التفاصيل الأساسية عن دوائك

# setSchedule
source: Set up your medication schedule
ar: قم بإعداد جدول دوائك

# configureDosing
source: Configure your dosing frequency
ar: قم بضبط تكرار الجرعة

# manageStock
source: Manage your medication stock
ar: أدر مخزون دوائك

# setupReminders
source: Set up low stock reminders
ar: قم بإعداد تذكيرات انخفاض المخزون

# almostDone
source: Almost done! Just a few more details
ar: أوشكت على الانتهاء! بعض التفاصيل الإضافية فقط

source: Choose Medicine Type *
ar: اختر نوع الدواء *

# strengthAndUnit
source: Strength & Unit
ar: التركيز والوحدة

source: Medicine Photo
ar: صورة الدواء

# tellUsAboutMedicine
source: Tell us about your medicine
ar: أخبرنا عن دوائك

# readyToContinue
source: Ready to continue to scheduling!
ar: جاهز للمتابعة إلى الجدولة!

source: Please enter medicine name
ar: الرجاء إدخال اسم الدواء

# pleaseSelectMedicineType
source: Please select medicine type and enter name
ar: الرجاء اختيار نوع الدواء وإدخال الاسم

source: Next
ar: التالي

source: Optional
ar: اختياري

source: Insights
ar: الرؤى

source: Health Insights
ar: الرؤى الصحية

# aiPoweredAnalysis
source: AI-powered analysis of your medication adherence
ar: تحليل مدعوم بالذكاء الاصطناعي لالتزامك بالأدوية

source: Your Health Journey
ar: رحلتك الصحية

source: Weekly Adherence Summary
ar: ملخص الالتزام الأسبوعي

source: Adherence Trend
ar: اتجاه الالتزام

source: Best Medication
ar: أفضل دواء

source: Current Streak
ar: السلسلة الحالية

source: Best Time of Day
ar: أفضل وقت في اليوم

source: Motivational Message
ar: رسالة تحفيزية

source: Loading insights...
ar: جارٍ تحميل الرؤى...

source: No insights yet
ar: لا توجد رؤى بعد

# startTrackingMessage
source: Start tracking your medications to see personalized health insights
ar: ابدأ بتتبع أدويتك لرؤية رؤى صحية مخصصة

# excellentAdherence
source: Excellent! You took {percent}% of your doses this week
ar: ممتاز! لقد تناولت {percent}% من جرعاتك هذا الأسبوع

# goodAdherence
source: Good job! You took {percent}% of your doses this week
ar: عمل جيد! لقد تناولت {percent}% من جرعاتك هذا الأسبوع

# needsImprovement
source: You took {percent}% of doses this week. Let's improve!
ar: لقد تناولت {percent}% من الجرعات هذا الأسبوع. لنحسن ذلك!

# keepUpGreatWork
source: Keep up the great work! You're doing fantastic!
ar: استمر في العمل الرائع! أنت تقوم بعمل رائع!

# consistencyIsKey
source: Consistency is key! You're making great progress.
ar: الاتساق هو المفتاح! أنت تحرز تقدماً رائعاً.

# youCanDoIt
source: You can do it! Every dose counts toward better health.
ar: يمكنك القيام بذلك! كل جرعة تحتسب لصحة أفضل.

# stayMotivated
source: Stay motivated! Your health is worth it.
ar: ابق متحفزاً! صحتك تستحق ذلك.

source: Diagnostics
ar: التشخيص

source: System Health
ar: صحة النظام

# appDiagnostics
source: App diagnostics and troubleshooting
ar: تشخيص التطبيق واستكشاف الأخطاء

source: System Information
ar: معلومات النظام

source: Permissions
ar: الأذونات

source: Database
ar: قاعدة البيانات

source: Testing
ar: الاختبار

source: Granted
ar: ممنوح

source: Denied
ar: مرفوض

source: Unknown
ar: غير معروف

source: Total Medications
ar: إجمالي الأدوية

source: Active Medications
ar: الأدوية النشطة

source: Total Dose History
ar: إجمالي سجل الجرعات

source: Database Size
ar: حجم قاعدة البيانات

source: Send Test Notification (Now)
ar: إرسال إشعار تجريبي (الآن)

# scheduleTestIn1Min
source: Schedule Test (1 Minute)
ar: جدولة اختبار (دقيقة واحدة)

source: Request All Permissions
ar: طلب جميع الأذونات

source: Open Notification Settings
ar: فتح إعدادات الإشعارات

source: Test notification sent!
ar: تم إرسال الإشعار التجريبي!

# testScheduled
source: Test notification scheduled for 1 minute from now
ar: تم جدولة الإشعار التجريبي بعد دقيقة من الآن

# permissionsRequested
source: Permission request sent
ar: تم إرسال طلب الأذونات

source: Troubleshooting Guide
ar: دليل استكشاف الأخطاء

# notificationsTroubleshoot
source: If notifications aren't working:
ar: إذا لم تعمل الإشعارات:

# enableNotificationsStep
source: 1. Enable notifications in app settings
ar: 1. قم بتفعيل الإشعارات في إعدادات التطبيق

# grantExactAlarmStep
source: 2. Grant 'Exact Alarm' permission (Android 12+)
ar: 2. امنح إذن 'المنبه الدقيق' (أندرويد 12+)

# disableBatteryOptStep
source: 3. Disable battery optimization for this app
ar: 3. قم بتعطيل تحسين البطارية لهذا التطبيق

# checkDoNotDisturbStep
source: 4. Check Do Not Disturb settings
ar: 4. تحقق من إعدادات عدم الإزعاج

# reinstallIfNeededStep
source: 5. Reinstall the app if issues persist
ar: 5. أعد تثبيت التطبيق إذا استمرت المشكلة

source: Search medications...
ar: ابحث عن الأدوية...

source: My Medications
ar: أدويتي

source: All Types
ar: جميع الأنواع

source: Active
ar: نشط

source: Paused
ar: متوقف مؤقتاً

# deleteMedicationQuestion
source: Delete Medication?
ar: حذف الدواء؟

source: Medication deleted
ar: تم حذف الدواء

# errorDeletingMedication
source: Error deleting medication: {error}
ar: خطأ في حذف الدواء: {error}

source: Schedule
ar: الجدول

source: History
ar: السجل

source: Pause
ar: إيقاف مؤقت

source: Resume
ar: استئناف

source: Medication paused
ar: تم إيقاف الدواء مؤقتاً

source: Medication resumed
ar: تم استئناف الدواء

# dose
source: Dose {number}
ar: جرعة

# medicationUpdated
source: Medication updated successfully!
ar: تم تحديث الدواء

source: Analytics
ar: التحليلات

source: Adherence Rate
ar: معدل الالتزام

source: Week
ar: أسبوع

source: Month
ar: شهر

source: Export Data
ar: تصدير البيانات

# dataExported
source: Data exported successfully!
ar: تم تصدير البيانات

source: Error exporting data
ar: خطأ في تصدير البيانات: {error}

source: Medication History
ar: سجل الأدوية

source: AI Assistant
ar: المساعد الذكي

source: Send
ar: إرسال

# aiThinking
source: AI is thinking...
ar: الذكاء الاصطناعي يفكر...

# aiWelcomeMessage
source: Hello! I'm your medication assistant. I can help you with: • Medication information • Dosage schedules • Side effects • General health questions How can I assist you today?
ar: مرحباً! أنا مساعدك الصحي الذكي. كيف يمكنني مساعدتك اليوم؟

source: Clear Chat
ar: مسح المحادثة

# chatCleared
source: Chat cleared! How can I help you today?
ar: تم مسح المحادثة

source: Snooze Options
ar: خيارات الغفوة

# tip1
source: 1. Make sure notifications are enabled in system settings
ar: 1. تأكد من تفعيل الإشعارات في الإعدادات

# tip2
source: 2. Grant 'Exact Alarms' permission (Android 12+)
ar: 2. امنح إذن 'المنبه الدقيق' (أندرويد 12+)

# tip3
source: 3. Disable battery optimization for this app
ar: 3. قم بتعطيل تحسين البطارية لهذا التطبيق

# tip4
source: 4. Check 'Do Not Disturb' is not blocking notifications
ar: 4. تحقق من أن عدم الإزعاج لا يحظر الإشعارات

# tip5
source: 5. Ensure the app has background permissions
ar: 5. تحقق من أن حجم الوسائط/التنبيه ليس صامتاً

# tip6
source: 6. Try rebooting your device
ar: 6. أعد تشغيل التطبيق بعد منح الأذونات

# tip7
source: 7. Clear app cache (Settings > Apps > MedAssist > Storage)
ar: 7. جرب إرسال إشعار تجريبي للتحقق من الإعداد

# tip8
source: 8. Reinstall the app if issues persist
ar: 8. تأكد من تفعيل الصوت والاهتزاز في إعدادات الإشعارات

# tip9
source: 9. Check if timezone is set correctly
ar: 9. تحقق من ضبط المنطقة الزمنية بشكل صحيح

# tip10
source: 10. Verify notification sound is not muted
ar: 10. تحقق من عدم كتم صوت الإشعارات

source: Add Medicine
ar: إضافة دواء

source: Take Dose
ar: تناول جرعة

source: View Stats
ar: عرض الإحصائيات

source: Ask AI
ar: اسأل الذكاء الاصطناعي

# noMedicationData
source: No medication data yet
ar: لا توجد بيانات أدوية بعد

# dosesProgress
source: {taken} of {total} doses taken
ar: {taken} من {total} جرعات تم تناولها

source: Best Time for Adherence
ar: أفضل وقت للالتزام

# reportsAndExport
source: Reports & Export
ar: التقارير والتصدير

# exportYourData
source: Export your data as CSV or PDF
ar: صدّر بياناتك كـ CSV أو PDF

source: Medications CSV
ar: أدوية CSV

source: Adherence PDF
ar: الالتزام PDF

# errorExporting
source: Error exporting data: {error}
ar: خطأ في تصدير البيانات: {error}

source: Go to today
ar: الذهاب لليوم

# errorLoadingHistory
source: Error loading history: {error}
ar: خطأ في تحميل السجل: {error}

source: No medication history
ar: لا يوجد سجل أدوية

# noDosesScheduled
source: No doses were scheduled for this date
ar: لا توجد جرعات مجدولة لهذا التاريخ

source: Stock Overview
ar: نظرة عامة على المخزون

source: Refresh stock
ar: تحديث المخزون

source: Stock Summary
ar: ملخص المخزون

source: Total
ar: الإجمالي

source: Critical
ar: حرج

source: Low
ar: منخفض

source: Good
ar: جيد

# errorLoadingStock
source: Error loading stock: {error}
ar: خطأ في تحميل المخزون: {error}

# addMedicationsToTrack
source: Add medications to track their stock levels
ar: أضف أدوية لتتبع مستويات مخزونها

source: Always here to help
ar: دائماً هنا للمساعدة

# aiErrorMessage
source: I apologize, but I'm having trouble responding right now. Please try again in a moment.
ar: أعتذر، لكن لدي مشكلة في الرد الآن. يرجى المحاولة مرة أخرى بعد لحظة.

source: Suggested questions:
ar: أسئلة مقترحة:

source: Quick Tips
ar: نصائح سريعة

source: Suggest Questions
ar: اقترح أسئلة

# giveMeTips
source: Give me medication tips
ar: أعطني نصائح للأدوية

source: Ask about medications...
ar: اسأل عن الأدوية...

source: More options
ar: خيارات أخرى

source: Receive medication reminders
ar: استقبل تذكيرات الأدوية

source: Play sound for notifications
ar: تشغيل صوت للإشعارات

source: Vibrate for notifications
ar: الاهتزاز للإشعارات

# testAndFix
source: Test and fix notification issues
ar: اختبر وإصلاح مشاكل الإشعارات

# notifyWhenLow
source: Notify when medication is running low
ar: التنبيه عند انخفاض كمية الدواء

# notifyWhenExpiring
source: Notify when medication is expiring soon
ar: التنبيه عند اقتراب انتهاء صلاحية الدواء

# restoreAllSettings
source: Restore all settings to default values
ar: استعادة جميع الإعدادات للقيم الافتراضية

# settingsAutoSaved
source: Settings are automatically saved and will be applied immediately
ar: يتم حفظ الإعدادات تلقائياً وسيتم تطبيقها فوراً

source: Choose Theme
ar: اختر السمة

# alwaysLight
source: Always use light theme
ar: استخدم السمة الفاتحة دائماً

# alwaysDark
source: Always use dark theme
ar: استخدم السمة الداكنة دائماً

# followSystem
source: Follow system theme settings
ar: اتبع إعدادات سمة النظام

# chooseLanguage
source: Choose Language / اختر اللغة
ar: اختر اللغة / Choose Language

# resetSettingsConfirm
source: Are you sure you want to reset all settings to their default values? This action cannot be undone.
ar: هل أنت متأكد من إعادة تعيين جميع الإعدادات للقيم الافتراضية؟ لا يمكن التراجع عن هذا الإجراء.

# settingsReset
source: Settings reset to defaults
ar: تم إعادة تعيين الإعدادات للافتراضي

source: Reset
ar: إعادة تعيين

source: Meal Timing
ar: توقيت الوجبة

source: Anytime
ar: في أي وقت

source: Before Meal
ar: قبل الوجبة

source: With Meal
ar: مع الوجبة

source: After Meal
ar: بعد الوجبة

# beforeMealDescription
source: Take 30-60 minutes before eating
ar: تناول قبل 30-60 دقيقة من الأكل

# withMealDescription
source: Take during or immediately after eating
ar: تناول أثناء أو مباشرة بعد الأكل

# afterMealDescription
source: Take 1-2 hours after eating
ar: تناول بعد 1-2 ساعة من الأكل

# testNotificationMessage
source: Test notification sent! Check your notification tray.
ar: تم إرسال إشعار تجريبي! تحقق من درج الإشعارات.

# errorMessage
source: Error: {error}
ar: خطأ: {error}

# notificationScheduled
source: Notification scheduled for 1 minute from now! Wait and see if it appears.
ar: تم جدولة الإشعار بعد دقيقة واحدة من الآن! انتظر وشاهد إذا ظهر.

# openingSettings
source: Opening settings. Please enable "Alarms & reminders" for MedAssist.
ar: فتح الإعدادات. يرجى تفعيل "المنبهات والتذكيرات" لـ MedAssist.

# permissionsGranted
source: Permissions granted! If exact alarms still shows NO, tap the red button below.
ar: تم منح الأذونات! إذا كانت المنبهات الدقيقة لا تزال تظهر لا، انقر على الزر الأحمر أدناه.

# someDenied
source: Some permissions denied. Please enable in settings.
ar: تم رفض بعض الأذونات. يرجى التفعيل في الإعدادات.

# selectTimezone
source: Select Your Timezone
ar: اختر منطقتك الزمنية

# scheduleTest
source: Schedule Test (1 Minute)
ar: جدولة اختبار (دقيقة واحدة)

# statusLabel
source: Status
ar: الحالة

# criticalExactAlarms
source: CRITICAL: Exact Alarms permission is OFF! Scheduled notifications will NOT work. Enable it below.
ar: حرج: إذن المنبهات الدقيقة متوقف! الإشعارات المجدولة لن تعمل. فعّله أدناه.

# timezoneUTC
source: Timezone is UTC! Notifications may not work correctly. Set your timezone below.
ar: المنطقة الزمنية هي UTC! قد لا تعمل الإشعارات بشكل صحيح. اضبط منطقتك الزمنية أدناه.

source: Expiring
ar: قرب الانتهاء

source: Expired
ar: منتهي الصلاحية

source: No medications yet
ar: لا توجد أدوية بعد

# startByAdding
source: Start by adding your first medication to keep track of your health
ar: ابدأ بإضافة دواءك الأول

source: No results found
ar: لم يتم العثور على نتائج

# tryAdjusting
source: Try adjusting your search or filters
ar: جرب تعديل عوامل التصفية أو البحث

# deleteMedicationConfirm
source: Are you sure you want to delete this medication? This action cannot be undone.
ar: هل أنت متأكد من حذف هذا الدواء؟

source: Name (A-Z)
ar: الاسم: أ-ي

source: Name (Z-A)
ar: الاسم: ي-أ

source: Date Added (Newest)
ar: الأحدث إضافة

source: Date Added (Oldest)
ar: الأقدم إضافة

source: Stock (Low to High)
ar: المخزون: من الأقل للأكثر

source: Stock (High to Low)
ar: المخزون: من الأكثر للأقل

# bulkDelete
source: Delete {count} medications?
ar: حذف جماعي

# bulkPause
source: Pause {count} medications?
ar: إيقاف جماعي

# bulkResume
source: Resume {count} medications?
ar: استئناف جماعي

source: Medication Not Found
ar: لم يتم العثور على الدواء

source: Per Dose
ar: لكل جرعة

source: Started
ar: بدأ

source: Ends
ar: ينتهي

source: Stock Status
ar: حالة المخزون

source: Available
ar: متوفر

source: Remaining
ar: متبقي

source: No dose history yet
ar: لا يوجد سجل جرعات بعد

source: No reminders set
ar: لم يتم تعيين تذكيرات

# failedToLoad
source: Failed to load medication
ar: فشل التحميل

source: Retry
ar: إعادة المحاولة

source: Discard Changes?
ar: تجاهل التغييرات

# discardChangesConfirm
source: Are you sure you want to discard your changes?
ar: هل أنت متأكد من تجاهل التغييرات؟

source: Discard
ar: تجاهل

source: Type
ar: النوع

source: Stock
ar: المخزون

source: Back
ar: رجوع

source: Save Changes
ar: حفظ التغييرات

# failedToUpdate
source: Failed to update medication
ar: فشل التحديث

# takenDoses
source: Taken
ar: الجرعات المأخوذة

# missedDoses
source: Missed
ar: الجرعات الفائتة

# skippedDoses
source: Skipped
ar: الجرعات المتخطاة

# totalDoses
source: Total
ar: إجمالي الجرعات

source: Best Streak
ar: أفضل سلسلة

# daysStreak
source: {days} days
ar: سلسلة الأيام

source: Trends & Insights
ar: الاتجاهات والرؤى

source: Medication Insights
ar: رؤى الأدوية

# chatbotWelcomeMessage
source: Hello! I'm your medication assistant. I can help you with: • Medication information • Dosage schedules • Side effects • General health questions How can I assist you today?
ar: مرحباً! أنا مساعدك للأدوية. يمكنني مساعدتك في: • معلومات الأدوية • جداول الجرعات • الآثار الجانبية • أسئلة صحية عامة كيف يمكنني مساعدتك اليوم؟

# chatbotErrorMessage
source: I apologize, but I'm having trouble responding right now. Please try again in a moment.
ar: أعتذر، لكن لدي مشكلة في الرد الآن. يرجى المحاولة مرة أخرى بعد لحظة.

source: Failed to load medication
ar: فشل تحميل الدواء

source: Failed to update medication
ar: فشل تحديث الدواء

source: Medication updated successfully!
ar: تم تحديث الدواء بنجاح!

source: Select medications
ar: اختر الأدوية

source: Select all
ar: اختر الكل

source: selected
ar: محدد

source: Medication(s) paused
ar: تم إيقاف الدواء/الأدوية مؤقتاً

source: Medication(s) resumed
ar: تم استئناف الدواء/الأدوية

source: Medication(s) deleted
ar: تم حذف الدواء/الأدوية

# noDosesScheduledForDate
source: No doses were scheduled for this date
ar: لا توجد جرعات مجدولة لهذا التاريخ

# chatClearedMessage
source: Chat cleared! How can I help you today?
ar: تم مسح المحادثة! كيف يمكنني مساعدتك اليوم؟

source: Give me medication tips
ar: أعطني نصائح للأدوية

# daysCount
source: {count} days
ar: {count} أيام

# dosesTakenOf
source: {taken} of {total} doses taken
ar: {taken} من {total} جرعات تم تناولها

source: Error loading stats
ar: خطأ في تحميل الإحصائيات

source: Error loading streak
ar: خطأ في تحميل السلسلة

source: No medication data yet
ar: لا توجد بيانات أدوية بعد

source: Error loading insights
ar: خطأ في تحميل الرؤى

source: Loading...
ar: جارٍ التحميل...

source: Medication Adherence Report
ar: تقرير الالتزام بالأدوية

source: Data exported successfully!
ar: تم تصدير البيانات بنجاح!

source: Skipped
ar: متخطى
